# Лабораторная работа №3
# РЕАЛИЗАЦИЯ И ИССЛЕДОВАНИЕ АЛГОРИТМОВ ПОСТРОЕНИЯ ОТРЕЗКОВ    
# 
# 1. Реализовать следующие алгоритмы построения отрезков 
# (предоставить пользователю возможность выбора алгоритма, 
# задания координат начала и конца отрезка, выбора цвета рисования)

# -Алгоритм, использующий библиотечную функцию;
# -Алгоритм цифрового дифференциального анализатора;
# -Алгоритм Брезенхема с действительными данными;
# -Алгоритм Брезенхема с целочисленными данными;
# -Алгоритм Брезенхема с устранением ступенчатости;
# -Алгоритм Ву.

#     2. Исследование визуальных характеристик при выводе отрезков 
# заданной длины в заданном спектре углов с помощью одного из алгоритмов 
# и наложения на полученный результат отрезков, построенных с помощью 
# другого алгоритма (цветом фона).

#     3. Исследование временных характеристик алгоритмов 
# (результат вывести в виде гистограммы).
#     4. Исследование ступенчатости отрезков. 
# Результат визуализировать в виде графика зависимости длины ступеньки 
# или количества ступенек в зависимости от угла наклона отрезка, 
# вывести для справки длину отрезка).


